/*
Задача 7.
Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на екрана.
*/

#include <stdio.h>

int main(void){

    int a = 5;
    int* p = &a;
    *p += 5;
    printf("The value of \"a\" is: %d", a);

    return 0;
}
