/*
На краищата на пътечка, разделена на М клетки, са поставени две разноцветни пионки. Противниците играят един след друг. 
Да се направи ход означава играчът да премести своята пионка на не повече от К клетки напред или назад, без да прескача другата пионка 
и без да излиза извън пътечката. 
Победител е онзи, който направи последния ход. 
Опишете алгоритъм за игра с добър противник при дадени числа М и К
*/

#include <math.h>
#include "lib.h"

int main(void){

    int size = boardSize();
    char array[size]; 
    drawBoard(size, array);
    int result = floor(size/2) - 1;
    int moves = maxMoves(result);
    game(moves, size, array);

    return 0;
}
